/**
 * 抖音接口类型
 */
export const enum DouyinDataType {
  二级评论数据 = '二级评论数据',
  用户主页数据 = '用户主页数据',
  单个视频作品数据 = '单个视频作品数据',
  评论数据 = '评论数据',
  用户主页视频列表数据 = '用户主页视频列表数据',
  热点词数据 = '热点词数据',
  搜索数据 = '搜索数据',
  官方emoji数据 = '官方emoji数据',
  动态表情数据 = '动态表情数据',
  音乐数据 = '音乐数据',
  图集作品数据 = '图集作品数据',
  实况图片图集数据 = '实况图片图集数据',
  直播间信息数据 = '直播间信息数据',
  申请二维码数据 = '申请二维码数据'
}

/**
 * B站接口类型
 */
export const enum BilibiliDataType {
  单个视频作品数据 = '单个视频作品数据',
  单个视频下载信息数据 = '单个视频下载信息数据',
  评论数据 = '评论数据',
  用户主页数据 = '用户主页数据',
  用户主页动态列表数据 = '用户主页动态列表数据',
  emoji数据 = 'emoji数据',
  番剧基本信息数据 = '番剧基本信息数据',
  番剧下载信息数据 = '番剧下载信息数据',
  动态详情数据 = '动态详情数据',
  动态卡片数据 = '动态卡片数据',
  直播间信息 = '直播间信息',
  直播间初始化信息 = '直播间初始化信息',
  登录基本信息 = '登录基本信息',
  申请二维码 = '申请二维码',
  二维码状态 = '二维码状态'
}

/**
 * 小红书接口类型
 */
export const enum XiaohongshuDataType {
  单个笔记 = '单个笔记'
}
